// قم بحل السؤال الأول هنا
let pets = ["cat","dog","rabbit","bird","fish"];
console.log(pets);
pets.pop();
console.log(pets);
pets.push("hamster");
console.log(pets);
pets[2]= "bee";
console.log(pets);

let cat = {name: "cat", age: 3 , type: "whatever:)"};
cat.emoji="🐈";
console.log(cat);
console.log(cat.age);

// 1. هل فكرت سابقاً في تربية حيوانات أليفة؟
//    <br> قم بإنشاء مصفوفة باسم pets تتكون من أسماء الحيوانات الأليفة
//    <br> التي تربيها أو تفكر في تربيتها (اختر 5
//    حيوانات على الأقل)

//    - قم بإزالة اسم الحيوان الأخير من المصفوفة
//    - قم بإضافة اسم حيوان جديد في نهاية المصفوفة
// //    - قم بتغيير اسم الحيوان عند المؤشر 2
// قم بإنشاء كائن (object) لقطة 🐈 أو أي حيوان آخر تختاره
//    <br> وأضف إليه الخصائص التالية:
//    <br> اسم الحيوان
//    <br> عمر الحيوان
//    <br> وأخيراً نوع الحيوان/السلالة التي ينتمي إليها

//    - قم بإضافة emoji كخاصية جديدة للحيوان
//    - قم بالوصول إلى عمر الحيوان وطباعته